app/controllers/comments_controller.rb

  def create
    @comment=Comment.new(comments_params)
    @comment.article_id=params[:article_id]
    @comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "aubin"], ["body", "njebenje"], ["article_id", 15], ["created_at", "2019-12-06 10:08:10.313628"], ["updated_at", "2019-12-06 10:08:10.313628"]]